---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyAssocPropError
source: html/0d615c4a-bc5b-ae34-e73b-89dda5ea435d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyAssocPropError Property

There is a circular dependency between a Line created with Pick Support and the supporting member.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencyAssocPropError { get; }
```